ruleset = {'000000': 'Святослав Юриков', '000001': 'Саша Копытко', '000010': 'Мария Улиткина', '000011': 'Кирилл Волкович', '000100': 'Анна Ивановна', '000101': 'Настя Райнус', '000110': 'Сергей Погорелов', '000111': 'Андрей Горлов', '001000': 'Катя Баклановна', '001001': 'Артем Сергеев', '001010': 'Артур Калинин', '001011': 'Костя Долгов', '001100': 'Настя Королева', '001101': 'Сеня Максимов', '001110': 'Яна Зорина', '001111': 'Максим Теребов', '010000': 'Михаил Панин', '010001': 'Анлрей Гневашев', '010010': 'Виталя Суслопаров', '010011': 'Арсений Еремеев', '010100': 'Зуад Фаед', '010101': 'Елена Драчева', '010110': 'Максим Ложкин', '010111': 'Саина Николаева', '011000': 'Иван Белоконь', '011001': 'Наташа Таргович', '011010': 'Дан Крылов', '011011': 'Катя Гусаева', '011100': 'Катя Ульянова'}
attributes = ["Высок(ий/ая)", "Любит гулять", "Общительн(ый/ая)", "Играет в Dota", "Играет в Minecraft", "Играет в карты"]

ans = input("Эта программа найдет человека по его характеристикам. Для того что бь ответить, напишите Да или Нет. Начать?\n")

if (ans[0].lower() != "д"):
    exit(0)

att_set = ""

for i in range(len(attributes)):
    attribute = attributes[i]

    while True:
        ans = input(f"Судент {attribute}?\n")[0].lower()

        if ans not in ("д", "н"):
            continue
        if ans == "д":
           att_set += "1"
           break
        else:
            att_set += "0"
            break


if att_set not in ruleset.keys():
    print("Студента с такими характеристиками нет")
    exit(0)

print(f"Вы загадали {ruleset[att_set]}.")